```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cloud-run-build.google_cloud_run_service.main has changed
  ~ resource "google_cloud_run_service" "main" {
        id                         = "locations/europe-west1/namespaces/playground-1a136/services/playground-service"
        name                       = "playground-service"
        # (4 unchanged attributes hidden)

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  + startup_probe {
                      + failure_threshold     = 1
                      + initial_delay_seconds = 0
                      + period_seconds        = 240
                      + timeout_seconds       = 240

                      + tcp_socket {
                          + port = 8080
                        }
                    }

                    # (2 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.github-repository.github_branch.main has changed
  ~ resource "github_branch" "main" {
        id            = "playground.ashdavies.dev:main"
      ~ sha           = "39d54df2c3fcf07f3b81b3aba6d1be29214b168b" -> "f4a76cfc5727445ae5194d684361682bf694d494"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.openapi_config must be replaced
-/+ resource "google_storage_bucket_object" "openapi_config" {
      ~ content          = (sensitive value) # forces replacement
      ~ content_type     = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c           = "wbyUjw==" -> (known after apply)
      ~ detect_md5hash   = "cE1jQibTOc8ssxcU7QdijQ==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "playground-runtime-openapi_config.yml" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "cE1jQibTOc8ssxcU7QdijQ==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/playground-runtime/o/openapi_config.yml?generation=1683930586900912&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "openapi_config.yml"
      ~ output_name      = "openapi_config.yml" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/playground-runtime/o/openapi_config.yml" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloud-run-build.google_cloud_run_service.main will be updated in-place
  ~ resource "google_cloud_run_service" "main" {
        id                         = "locations/europe-west1/namespaces/playground-1a136/services/playground-service"
        name                       = "playground-service"
        # (4 unchanged attributes hidden)

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/playground-1a136/cloud-run-source-deploy/playground.ashdavies.dev@sha256:3fa98c61e1b123954382e82e9c2ea9dfb67932a6b0a58c3e02b48c09178f79cd" -> "europe-west1-docker.pkg.dev/playground-1a136/cloud-run-source-deploy/playground.ashdavies.dev@sha256:1aa645c1f13bf0124fdb9ca256c51673fc665483b8198b97cbc715cc6ca3d586"
                    # (2 unchanged attributes hidden)

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloud-run-endpoint.google_cloud_run_service.main will be updated in-place
  ~ resource "google_cloud_run_service" "main" {
        id                         = "locations/europe-west1/namespaces/playground-1a136/services/playground-endpoint"
        name                       = "playground-endpoint"
        # (4 unchanged attributes hidden)

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/playground-1a136/endpoints-release/endpoints-runtime-serverless:2.40.0-playground.ashdavies.dev-2023-05-12r8" -> "europe-west1-docker.pkg.dev/playground-1a136/endpoints-release/endpoints-runtime-serverless:2.40.0-playground.ashdavies.dev-2023-05-17r0"
                    # (2 unchanged attributes hidden)

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloud-run-endpoint.google_endpoints_service.main will be updated in-place
  ~ resource "google_endpoints_service" "main" {
      ~ config_id      = "2023-05-12r8" -> "2023-05-17r0"
        id             = "playground.ashdavies.dev"
      ~ openapi_config = <<-EOT
            swagger: "2.0"
            info:
              title: "Playground Service"
              description: "Playground Service definition hosted by Cloud Endpoints with a Cloud Run backend"
              version: "1.0.0"
          -   x-version-name: "39d54df"
          +   x-version-name: "f4a76cf"
            host: "playground.ashdavies.dev"
            schemes:
              - "https"
            consumes:
              - "application/json"
            produces:
              - "application/json"
            paths:
              /events:
                get:
                  tags: [ "events" ]
                  summary: "Return events by start date"
                  operationId: "getEvents"
                  parameters:
                    - name: "startAt"
                      in: "query"
                      type: "string"
                      format: "date"
                      description: "The start date to start this query at."
                    - name: "orderBy"
                      in: "query"
                      type: "string"
                      description: "The field to sort by."
                    - name: "limit"
                      in: "query"
                      type: "integer"
                      format: "int32"
                      description: "The maximum number of items to return."
                  responses:
                    "200":
                      description: "OK"
                      schema:
                        type: "array"
                        items:
                          $ref: "#/definitions/Event"
                  security:
                    - ApiKeyAuth: [ ]
                      AppCheckAuth: [ ]
              /events:aggregate:
                post:
                  tags: [ "events" ]
                  summary: "Aggregate events from data sources"
                  operationId: "aggregateEvents"
                  responses:
                    "200":
                      description: "OK"
                  security:
                    - ApiKeyAuth: [ ]
                      AppCheckAuth: [ ]
              /firebase/auth:
                post:
                  tags: [ "firebase" ]
                  summary: "Signs in or signs up a user"
                  description: >
                    Signs in or signs up a user by exchanging a custom Auth token for the given UID. Upon a 
                    successful sign-in or sign-up, a new Identity Platform ID token and refresh token are
                    issued for the user.
                  operationId: "signIn"
                  parameters:
                    - name: "body"
                      in: "body"
                      required: true
                      schema:
                        type: "object"
                        required:
                          - "uid"
                        properties:
                          uid:
                            type: "string"
                            description: >
                              The UID to store in the token. This identifies the user to other Firebase
                              services (Realtime Database, Firebase Auth, etc.). Should be less than 128
                              characters.
                            example: "jane.smith@example.com"
                  responses:
                    "200":
                      description: "OK"
                      schema:
                        $ref: "#/definitions/AuthResult"
              /firebase/token:
                post:
                  tags: [ "firebase" ]
                  summary: "Creates a new App Check token"
                  operationId: "createToken"
                  parameters:
                    - name: "body"
                      in: "body"
                      required: true
                      schema:
                        $ref: "#/definitions/FirebaseApp"
                  responses:
                    "200":
                      description: "OK"
                      schema:
                        $ref: "#/definitions/AppCheckToken"
              /firebase/token:verify:
                put:
                  tags: [ "firebase" ]
                  summary: "Verifies an App Check token"
                  description: >
                    Verifies a Firebase App Check token (JWT). If the token is valid, the promise is fulfilled
                    with the token's decoded claims; otherwise, the promise is rejected.
                  operationId: "verifyToken"
                  parameters:
                    - name: "X-Firebase-AppCheck"
                      in: "header"
                      description: "The App Check token to verify"
                      required: true
                      type: "string"
                  responses:
                    "200":
                      description: "OK"
                      schema:
                        $ref: "#/definitions/DecodedToken"
                    "400":
                      description: "Request is missing app check token header"
              /hello:
                get:
                  tags: [ "hello" ]
                  summary: "Greet the user"
                  operationId: "helloWorld"
                  responses:
                    "200":
                      description: "OK"
              /openapi/documentation.yml:
                get:
                  tags: [ "openapi" ]
                  summary: "OpenAPI Documentation"
                  operationId: "openApiDocumentation"
                  responses:
                    "200":
                      description: "OK"
            
            definitions:
              AppCheckToken:
                type: "object"
                required:
                  - "ttlMillis"
                  - "token"
                properties:
                  ttlMillis:
                    type: "integer"
                    format: "int64"
                    description: "The time-to-live duration of the token in milliseconds"
                  token:
                    type: "string"
                    description: "The Firebase App Check token"
              AuthResult:
                type: "object"
                properties:
                  idToken:
                    type: "string"
                    description: "A Firebase Auth ID token generated from the provided custom token."
                  refreshToken:
                    type: "string"
                    description: "A Firebase Auth refresh token generated from the provided custom token."
                  expiresIn:
                    type: "integer"
                    format: "int64"
                    description: "The number of seconds in which the ID token expires."
                    example: 3600
              DecodedToken:
                type: "object"
                required:
                  - "audience"
                  - "expiresAt"
                  - "issuedAt"
                  - "subject"
                  - "issuer"
                  - "appId"
                properties:
                  audience:
                    type: "array"
                    description: >
                      The audience for which this token is intended. This value is a JSON array of two strings,
                      the first is the project number of your Firebase project, and the second is the project
                      ID of the same project.
                    items:
                      type: "string"
                  expiresAt:
                    type: "integer"
                    format: "int64"
                    description: >
                      The App Check token's expiration time, in seconds since the Unix epoch. That is, the time
                      at which this App Check token expires and should no longer be considered valid.
                    example: "1672497116"
                  issuedAt:
                    type: "integer"
                    format: "int64"
                    description: >
                      The App Check token's issued-at time, in seconds since the Unix epoch. That is, the time
                      at which this App Check token was issued and should start to be considered valid.
                    example: "1672493516"
                  subject:
                    type: "string"
                    description: >
                      The Firebase App ID corresponding to the app the token belonged to. As a convenience,
                      this value is copied over to the | app_id property.
                    example: "1:1234567890:android:321abc456def7890"
                  issuer:
                    type: "string"
                    description: >
                      The issuer identifier for the issuer of the response. This value is a URL with the format
                      https://firebaseappcheck.googleapis.com/<PROJECT_NUMBER>, where <PROJECT_NUMBER> is the
                      same project number specified in the | aud property.
                    example: "https://firebaseappcheck.googleapis.com/1234567890"
                  appId:
                    type: "string"
                    description: >
                      The App ID corresponding to the App the App Check token belonged to. This value is not
                      actually one of the JWT token claims. It is added as a convenience, and is set as the
                      value of the | sub property.
                    example: "1:1234567890:android:321abc456def7890"
              Event:
                type: "object"
                required:
                  - "id"
                  - "name"
                  - "website"
                  - "location"
                  - "dateStart"
                  - "dateEnd"
                properties:
                  id:
                    type: "string"
                  name:
                    type: "string"
                  website:
                    type: "string"
                  location:
                    type: "string"
                  status:
                    type: "string"
                  online:
                    type: "boolean"
                  dateStart:
                    type: "string"
                    format: "date"
                  dateEnd:
                    type: "string"
                    format: "date"
                  cfp:
                    type: "object"
                    properties:
                      start:
                        type: "string"
                        format: "date"
                      end:
                        type: "string"
                        format: "date"
                      site:
                        type: "string"
              FirebaseApp:
                type: "object"
                required:
                  - "appId"
                properties:
                  appId:
                    type: "string"
                    description: "The app ID to use as the JWT app_id"
                    example: "1:1234567890:android:321abc456def7890"
            securityDefinitions:
              ApiKeyAuth:
                name: "X-API-Key"
                type: "apiKey"
                in: "header"
              AppCheckAuth:
                name: "X-Firebase-AppCheck"
                type: "apiKey"
                in: "header"
            security:
              - ApiKeyAuth: [ ]
            x-google-backend:
              address: "https://playground-service-p5oyff7kqq-ew.a.run.app"
              protocol: "h2"
        EOT
        # (5 unchanged attributes hidden)
    }

  # module.cloud-run-endpoint.null_resource.main must be replaced
-/+ resource "null_resource" "main" {
      ~ id       = "7615028722051722053" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "config_id" = "2023-05-12r8" -> "2023-05-17r0"
        }
    }

Plan: 2 to add, 3 to change, 2 to destroy.

```